[
  {
    "id": 1,
    "slug": "round-one-playoff-preview",
    "title": "Round One Playoff Preview",
    "date": "2025-08-15",
    "excerpt": "The playoffs are here! With that comes a matchup steeped in history, grit, and respect. The third-seeded Juice will take on the sixth-seeded Crows in a series that's anything but your standard 3 vs 6.",
    "featured": true,
    "image": "/images/news/2025-wild-card-weekend.jpg",
    "content": "The playoffs are here! With that comes a matchup steeped in history, grit, and respect. The third-seeded Juice will take on the sixth-seeded Crows in a series that's anything but your standard 3 vs 6. Let's break down the first matchup of the 2025 postseason.\n\n**Juice: Veteran Presence, Elite Pitching, and a Chance at Redemption**\n\nThe Juice have been in this position before. They know how to make noise when it counts. This is a franchise that's no stranger to deep playoff runs, championship contention, or carrying the weight of expectations. And in 2025, they've built their season on one core principle: pitching wins games.\n\nAnchoring their rotation are Adam Brickett and Aaron Hunter, a one-two punch that's as intimidating as it is seasoned. Brickett's rising slider has given even the league's best hitters nightmares, while Hunter (former MVP, Cy Young winner, and 2024 Hall of Fame inductee) continues to show his elite command looks as good as ever. Plan B, of course, is most teams' Plan A: Epo Olivares. Epo — whose mononym is up there with Bono, Ichiro, and Sheryl — is a Hall of Famer and the league's all time strikeout king, ready in the bullpen and as dangerous as ever.\n\nWhere the Juice haven't dominated in 2025 is with the bats, but that doesn't mean they aren't effective. Their team wRC+ is 102, almost perfectly average, which comes from savvy, situational hitting. They're also remarkably balanced; while their top hitter has a lower wRC+ than the top hitters from the rest of the playoff field, they also feature a lineup with six qualified hitters above league average. They're disciplined, experienced, and focused on execution. This team knows how to put runners on, move them over, and cash them in when it matters.\n\nGabe Showalter and his Juice will need to grind through at-bats and take advantage of key moments, especially against a Crows team known for its defensive stinginess. If they do, they'll not only have a shot at advancing, but they'll be eyeing a revenge series against the Bilabial Stops, whom they split with earlier in the year. That one's been circled for a while.\n\n**Crows: Defense, Grit, and One Series Away From Belief Becoming Reality**\n\nLet's be clear: this isn't just a team fighting for relevance. The Crows believe they belong. Every season, they hang around. Every season, they make you earn it. And now, once again, they're back in the dance.\n\nThe front of their pitching attack has been Connor Donovan, their reliable front-mound anchor. Sure, he's a short-mound guy, but his stuff flashes all the same. \"Furious Connor\" has been calm under pressure all year, and when he's attacking the zone, the Crows are tough to score on because of their sharp defense. Complimentary to Donovan, Evan Grey and Drew Helgren bring a different look from the back rubber. When they're locked in, even in flashes, their stuff is filthy. But with any back mounder, it's all about consistency around the strike zone. These guys are not looking for 12 perfect innings. They just need to piece together enough consistency to steal a game. If that newfound depth comes through, the Crows will have options most teams envy.\n\nOffensively, the Crows post a team wRC+ of 97, just slightly below league average. The story is in their approach: They are great at spitting on sloppy pitching outside the zone, with relentless discipline. Then capitalize with contact when they get their pitch. The goal of the Crows isn't to slug. Their goal is to fly, to expose your mistakes, take their bases, and let their defense win the day. Because if you're hitting the ball near any of their defenders… Good luck.\n\nThe Crows are known league-wide for playing some of the most fundamentally sound, mistake-free defense in the league. Every out is earned. Every base is contested. And if they can take this first series, the confidence and momentum could be just enough to make the top-seeded Wiffle House sweat. A win here guarantees a matchup against the champs, and the Crows would love nothing more than to be the ones to take the crown off their head. Caw, caw, indeed.\n\n**The Matchup: Pressure, Patience, and a Clash of Styles**\n\nThese teams split their regular season series, with the Crows having a slightly higher run differential in that series. The numbers between these teams are tight, but the matchups are what make this fascinating:\n\n* Juice pitching vs Crows patience: The Juice lead with a higher strikeout rate, but the Crows are notorious for working counts and making you labor. If the Juice can live in the zone and force contact, they can limit free passes and lean on their defensive core to get outs.\n* Crows pitching vs Juice execution: If the Crows can get competitive innings from their back mound, they might frustrate a Juice offense that isn't built to blow games open. But if the Juice can extend at-bats and slug selectively, they may break the game open before the Crows can settle in.\n* X-Factors: The key for the Crows is to make the Juice put the ball in play and lean on their defense. The key for the Juice is to work at-bats, and be aggressive with hittable pitches to generate some slug.\n\nOn paper, it's a 3 vs 6. On the field, it's two battle-tested teams with playoff scars and championship dreams. The series may come down to one moment, one inning, one pitch.\n\nIf the Juice win, they will be looking at a matchup with the Stops, who they split with in the regular season. They'd love nothing more than to knock them out. If the Crows win, they would land a matchup against the first seed, hoping to rattle the windows of Wiffle House and prove that in life, nothing can truly be 24/7.\n\nEither way… buckle up. The postseason is here.\n\n## **Swingdome @ American Dreams**\n\nAnother chapter in one of Seattle Wiffleball's most competitive and enduring rivalries is about to be written. The #4-seed American Dreams face off against the #5-seed Swingdome in a rematch that's equal parts déjà vu and escalation. The teams split their 2025 regular season series, just like they did in 2024 (when, anathema to the spirit of the very game of wiffleball, both games ended in ties).\n\nThese teams know each other's strengths. They know each other's tells. They know what it takes to win in October (aka late-August). And now they'll fight for the right to move one step closer to the World Series.\n\n**Swingdome: Built to Rake, Built to Rattle**\n\nIt's been a few seasons since the Dome rebranded, but their identity hasn't changed — they hit the hell out of the ball.\n\nThis year, they've mashed their way through the schedule with a WRC+ that would make any pitcher nervous. Alex Hatch has emerged as the most feared hitter in the league, with tape-measure power and a swagger to match. Steve McGinley has been an OBP machine, grinding out at-bats and always finding a way on. And Captain Jimmy Froio continues to deliver pro-level approaches and timely hits.\n\nBut it's not just those three. The entire Swingdome lineup is capable of clearing the fence, and clearing the bases. Their playstyle is simple and devastating: score early, score often, and force you to try and keep up.\n\nOn the mound, they've turned to Hatch as a back-mound shutdown specialist. He held a 0.00 ERA through the first half of the season, and when he's locating, you might as well bring a paddle instead of a bat. Froio handles the front-mound duties with guile, deception, and just enough chaos. His mission? Confuse the hell out of you. Off-speed junk, sliders off the zone, fastballs that ride — all designed to make you chase, pop up, or whiff and walk back shaking your head.\n\nHowever, without their other elite lefty, Nick Ludwig, who's playing overseas (aka the badlands somewhere in Southern California), there have been questions surrounding Swingdome's pitching depth. If Hatch and Froio can't carry the load alone, it opens a door, just a crack, for opponents to exploit.\n\n**American Dreams: The Defensive Juggernaut**\n\nThe Dreams have built their identity around one simple principle: you can't score if you can't get on base. Their defensive unit has been the backbone of their success, with a combination of athleticism, positioning, and pure determination that makes every inning a battle.\n\nLed by their captain, the Dreams have developed a reputation for making the impossible look routine. Whether it's diving catches in the outfield, lightning-quick double plays, or simply being in the right place at the right time, this team knows how to get outs when they need them most.\n\nOffensively, they may not have the power numbers of some teams, but they excel at manufacturing runs. They're patient at the plate, willing to take walks and work counts, and they have the speed to turn singles into doubles and doubles into triples. Small ball is their game, and they play it to perfection.\n\n**The Rivalry Renewed**\n\nThis matchup represents more than just a playoff game — it's the continuation of a rivalry that has defined both franchises. The intensity will be palpable from the first pitch, with both teams knowing that bragging rights and playoff advancement are on the line.\n\nThe Dreams will look to their defense to keep them in games, while the Dome will rely on their explosive offense to put up runs in bunches. It's a classic matchup of contrasting styles, and it should make for some of the most entertaining baseball of the postseason.\n\nAs the teams prepare for battle, one thing is certain: this series will be remembered for years to come. The stakes are high, the emotions will run hot, and the baseball will be nothing short of spectacular.\n\nBuckle up, Seattle Wiffleball fans. The playoffs are here, and they're going to be unforgettable."
  },
  {
    "id": 2,
    "slug": "kind-of-new-and-somewhat-improved",
    "title": "Kind of New and Somewhat Improved: A 2019 Season Preview",
    "date": "2019-05-04",
    "excerpt": "The wind blows through a little fresher. The sun hangs around a little longer. Cowen Park dries out and leaves an actual field behind. Soft plastic connects with hard plastic. It is that time of year, friends: wiffleball is back.",
    "featured": false,
    "image": "/images/news/season-preview-2019.jpg",
    "content": "The wind blows through a little fresher. The sun hangs around a little longer. Cowen Park dries out and leaves an actual field behind. Soft plastic connects with hard plastic. It is that time of year, friends: wiffleball is back.\n\nBefore we look forward to 2019, we must do a proper tribute to what has been left behind in 2018.\n\n##### Walks With Four Balls Runs Out of Name Changes\n\nYou may know them as Wiff Waff, Get A Wiff, or Walks With Four Balls, but this founding team of Seattle Wiffleball has chosen to fold this season. Captains Andrew Ybarra and Greg Nyssen held their teams together with grit and sheer force of will, and could always be accounted for a competitive match week in and week out. We wish them the very best in their \"retirement\".\n\n##### Cannonball Coming Hangs 'Em Up\n\nAfter three wonderful years in Seattle Wiffleball, Cannonball Coming and captain Patrick Meagher will be stepping back from the league this season. As an opponent on the field, I will not miss their crafty pitching and power hitting. As a league, we will dearly miss their enduring sportsmanship, impressive athleticism, and full embrace of dad swag.\n\n##### Swing at the Fence\n\nPlastic construction wire, hot orange and frayed. Bamboo poles woven in with various lengths and strengths. A constant struggle to stay upright in the lightest breeze. The fence has been a known health, safety, and gameplay hazard for the last five years -- I am happy to report that it has been replaced.\n\n#### _On to the happier stuff..._\n\n##### A New Fence Approaches!\n\nSmooth blue fabric, well-attached and stretched taught. Plastic poles that can bend all the way down to the ground before popping back upright. Stake inserts for solid and consistent setup. The new fence was advertised to us as a dream, and hopefully it will live up to that dream!\n\n_Narrator: It did not live up to that dream._\n\n##### Rule Changes\n\nIn an effort to improve the game experience and encourage balls in play, the following rule changes have been made:\n\n**1. 68 mph speed limit.** Pitchers may throw no harder than 68 mph. If they do, the offense may take a ball or the result of the pitch. An exemption is made for the first such pitch in an at-bat, where the offense may take a no-pitch or the result of the pitch.\n\n**2. Sixth fielder.** Teams may now play with a pitcher and five fielders. All fielders must bat, but four-member lineups are still permitted.\n\n**3. Free defensive positioning.** Defenders in the field may position themselves anywhere in fair territory, as long as they do not interfere with the batter.\n\n**4. Mandatory use of league balls.** The league will provide stamped game balls to ensure a uniform offensive environment. Pitchers may scuff league balls using league tools. A bullpen will be set up so pitchers may practice with league balls before their games.\n\n**5. Optional mercy rule.** If a team is behind by more than 20 runs after two innings, they may opt into the mercy rule.\n\n##### The Rookie-ish Teams\n\nWe are excited to welcome four new teams into the league this year, many of which are captained by players returning from last season. Let's get hype!\n\n**ISO Pale**\n\nOtto Par, long-time pitcher for Walks With For Balls, has taken his talents to a team of his own. Recruited from his friends and bolstered by free agents, they wanna bring the power and place the league beyond the Pale.\n\n**Sheryll Crows**\n\nIf you are a long-suffering Mariners fan, you almost certainly know about Lookout Landing and their wonderful writing. Eric Sanford, formerly of Cannonball Coming, has rallied his fellow writers together and brought a sunny murder to Cowen.\n\n**TBD (\"Voltron\")**\n\nBack like they never left, Greg Nyssen (WWFB) and Spencer Minder (Sons of Pitches) are leading a brand new team. Frances Nyssen (WWFB), Jonathan Stevens (SP), and Karl Koch (CC) also appear on the roster, Voltroning together with a few free agents.\n\n**TBD (\"Gang of Misfits\")**\n\nA gang of misfits with a passion for wiffle. Captain Brown has the difficult task of bringing together a squad of talented free agents and forming a real team out of them. Sons of Pitches faced a similar road last year and made the playoffs. Can it happen again?\n\n##### The Veteran Teams\n\nWe have four teams returning to play ball this year. You know them and you love them, but just in case you need a refresher, we are gonna preview them too.\n\n**100% Real Juice**\n\nThe reigning champs. A perennial contender with devilishly good pitching and powerful hitting, Gabe Showalter looks to lead his band of brothers into battle once more and grab the first back-to-back titles in league history.\n\n**West Coast Washout**\n\nThe runners-up. After a heartbreaking finish in the Series last year, Jeremy Salvo continues to oversee a long lineup and deep bullpen. Six athletic fielders are also going to cause a problem for opposing teams.\n\n**RBI Steaks**\n\nAfter a bit of a down year last season, largely due to major events in the lives of many teammates, Jimmy Froio will try to get the band back together in search of a second title. They certainly have the talent, but it takes more than that to rebuild a dynasty.\n\n**Chicken 'n' Wiffles**\n\nIn contention for the playoffs nearly all of last season, Matt Pearson's squad was pushed aside in the final week. The pitching and defense need to improve for this team to find the postseason, and a few more hits certainly wouldn't hurt."
  },
  {
    "id": 3,
    "slug": "new-seattle-wiffleball-website",
    "title": "The New Seattle Wiffleball Website: Launched Like a James Shields Fastball",
    "date": "2019-05-04",
    "excerpt": "I don't know what I was thinking when I decided to create a new league website from scratch, but here it is. Scores, league leaders, and standings are no longer buried in a series of dropdown menus.",
    "featured": false,
    "image": "/images/news/website-launch.jpg",
    "content": "I don't know what I was thinking when I decided to create a new league website from scratch, but here it is. Scores, league leaders, and standings are no longer buried in a series of dropdown menus. Liam will no longer have to endure the bizarre, medieval torture of entering stats into League Lineup. And last but not least, no more carefully targeted ad-**vert**isements reminding you that Lysol produces the finest lemon-scented disinfecting wipes that money can buy. Welcome to the new home of Seattle Wiffleball.\n\nThere was a lot of luck involved in wrangling some really cool features for this site. The stat pages are completely driven by Google Sheets, which means we can add just about any stat that can be calculated from what we capture in GameChanger. The schedule is readily accessible - it's easy to see who is playing who, when, and we can finally end the decades-long debate over who is _truly_ the home team. Team histories, an easily navigable rulebook, and mobile decency are just a few of the features that should make our online experience a little better than in years past.\n\nThis is still a work in progress. Player profiles are still in development, there are some skeletons in the closet that would make a legit programmer violently diarrhoeal, and there are probably a few bugs to work out. That being said, please do send us your feedback and suggestions and we'll do our best to fold them in. Cheers."
  },
  {
    "id": 4,
    "slug": "its-crunch-time",
    "title": "It's Crunch Time",
    "date": "2025-07-28",
    "excerpt": "From one coast to another, from legends to the legend, last Sunday was a formative day for all ballplayers...",
    "featured": false,
    "image": "/images/news/crunch-time.jpg",
    "content": "From one coast to another, from legends to the legend, last Sunday was a formative day for all ballplayers in the Seattle Wiffleball League. As the sun set over Cowen Park, the air was thick with anticipation. Players from all corners of the league gathered for what would become one of the most memorable games of the season.\n\n## The Stage Was Set\n\nAs the sun set over Cowen Park, the air was thick with anticipation. Players from all corners of the league gathered for what would become one of the most memorable games of the season.\n\n## Key Moments\n\n- **Top of the 3rd**: A spectacular diving catch by the Bilabial Stops outfield\n- **Bottom of the 4th**: Three-run homer that cleared the makeshift fence\n- **Final Inning**: Nail-biting finish with bases loaded and two outs\n\n## What This Means\n\nThis game wasn't just about the final score—it was about the spirit of competition, the bonds of friendship, and the pure joy of playing the game we all love.\n\n## Looking Ahead\n\nWith the playoffs just around the corner, every game matters more than ever. The intensity is building, and we can't wait to see what happens next.\n\n---\n\n*Written by the Seattle Wiffleball League Team*"
  },
  {
    "id": 5,
    "slug": "in-season-tournament",
    "title": "Sign up for the In-Season Tournament",
    "date": "2025-06-19",
    "excerpt": "The 2nd Annual Seattle Wiffle In-Season Tournament is coming up! Join us for a day of competitive play...",
    "featured": false,
    "image": "/images/news/tournament.jpg",
    "content": "The 2nd Annual Seattle Wiffle In-Season Tournament is coming up! Join us for a day of competitive play and camaraderie. This tournament brings together teams from across the league for an exciting day of wiffleball action.\n\n## Tournament Details\n\n- **Date**: TBD\n- **Location**: Cowen Park\n- **Format**: Double elimination\n- **Entry Fee**: $50 per team\n\n## What to Expect\n\nThis tournament brings together teams from across the league for an exciting day of wiffleball action. Whether you're a seasoned veteran or a newcomer to the league, there's a place for you in this tournament.\n\n## Registration\n\nTo register your team, please contact the league office or visit our registration page. Spots are limited, so don't wait too long to secure your team's place in this exciting event.\n\n---\n\n*Join us for a day of competitive play and camaraderie!*"
  },
  {
    "id": 6,
    "slug": "season-preview",
    "title": "2025 Season Preview",
    "date": "2025-05-17",
    "excerpt": "Picture the scene: Freshly-mown grass. A twelve-pack on the ground. Yellow bats strewn everywhere...",
    "featured": false,
    "image": "/images/news/season-preview-2025.jpg",
    "content": "Picture the scene: Freshly-mown grass. A twelve-pack on the ground. Yellow bats strewn everywhere. The 2025 season is shaping up to be one of the most exciting yet, with new players joining established veterans in what promises to be a memorable year.\n\n## New Season, New Opportunities\n\nThe 2025 season brings with it new challenges, new rivalries, and new opportunities for teams to make their mark on the league. With several new players joining established veterans, the competition promises to be fiercer than ever.\n\n## Key Storylines to Watch\n\n- **Defending Champions**: Can the reigning champs repeat their success?\n- **Rising Stars**: Which new players will emerge as league leaders?\n- **Team Dynamics**: How will roster changes affect team chemistry?\n- **Playoff Race**: Which teams will separate themselves from the pack?\n\n## Season Outlook\n\nAs we prepare for another exciting season of Seattle Wiffleball, one thing is certain: the competition will be fierce, the games will be memorable, and the camaraderie will be unmatched. Here's to another great season!\n\n---\n\n*The 2025 season is shaping up to be one of the most exciting yet!*"
  }
]
